app/controllers/markets_controller.rb

  def index
    @market = Market.all
---
SELECT "markets".* FROM "markets"