app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", "74aa52bf-4407-4fc2-87b7-b7576ad563c8"]]
---
  def index
    # @posts = current_user.posts
    # @posts = current_user.posts.search(params[:search])
    # if @posts.blank?
    #   @posts = Post.search(params[:search])
    # else
    #   flash[:notice] = 'No results'
    # end

    if params[:search].nil?
      @posts = current_user.posts
    else
      @posts = @posts.search(params[:search])