app/controllers/users_controller.rb

  def get_user
    # @user = User.find_by(slug: params[:id])
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "b7170382-a305-454e-ab15-ad71e9ea6020"], ["LIMIT", 1]]