app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", "b7170382-a305-454e-ab15-ad71e9ea6020"], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "middle_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Houphouet"], ["middle_name", ""], ["updated_at", "2021-04-13 11:17:26.855632"], ["id", "b7170382-a305-454e-ab15-ad71e9ea6020"]]
---
  def update
    @user = User.find(params[:id])
      if @user.update(user_params)