app/models/user.rb

  def create_subscription
    Subscription.create(user_id: id) if subscription.nil?
---
INSERT INTO "subscriptions" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", "b7170382-a305-454e-ab15-ad71e9ea6020"], ["created_at", "2021-04-11 16:10:08.677252"], ["updated_at", "2021-04-11 16:10:08.677252"]]